# Build tools
brew "cmake"
brew "ninja"
brew "pkg-config"

# Ghidra dependencies
brew "openjdk@21"
brew "gradle"

# Dependencies
brew "sdl2"
brew "protobuf"
brew "curl"
brew "libzip"
brew "bzip2"
brew "vulkan-loader"
brew "glslang"
brew "shaderc"
brew "glm"
brew "jsoncpp"